Revit 2021.1 API
UnitUtils.GetUnitTypeId Method
 Gets the ForgeTypeId identifying the given unit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2014
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2021 and may be removed in a future version of Revit. It will not be replaced, but until its removal it may be used to help migrate code that uses the `DisplayUnitType` enumeration to the `ForgeTypeId` class.")]
public static ForgeTypeId GetUnitTypeId(
	DisplayUnitType displayUnitTypeEnum
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2021 and may be removed in a future version of Revit. It will not be replaced, but until its removal it may be used to help migrate code that uses the `DisplayUnitType` enumeration to the `ForgeTypeId` class.")> _
Public Shared Function GetUnitTypeId ( _
	displayUnitTypeEnum As DisplayUnitType _
) As ForgeTypeId
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2021 and may be removed in a future version of Revit. It will not be replaced, but until its removal it may be used to help migrate code that uses the `DisplayUnitType` enumeration to the `ForgeTypeId` class.")]
public:
static ForgeTypeId^ GetUnitTypeId(
	DisplayUnitType displayUnitTypeEnum
)
Parameters
displayUnitTypeEnum
Type: Autodesk.Revit.DB.DisplayUnitType
 The unit.
Return Value
 The identifier of the given unit.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
UnitUtils Class
Autodesk.Revit.DB Namespace